import math


def area(r):
    '''
    Возвращает площадь круга по заданному радиусу.

            Параметры:
                    r (int/float): радиус круга

            Возвращаемое значение:
                    math.pi * r * r (float): площадь круга

            Пример вызова:
                    area(5) -> 78.53981633974483
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности (периметр) по заданному радиусу.

            Параметры:
                    r (int/float): радиус круга

            Возвращаемое значение:
                    2 * math.pi * r (float): длина окружности

            Пример вызова:
                    perimeter(5) -> 31.41592653589793
    '''
    return 2 * math.pi * r