def area(a, b):
    '''
    Возвращает площадь прямоугольника по двум сторонам.

            Параметры:
                    a (float): первая сторона прямоугольника
                    b (float): вторая сторона прямоугольника

            Возвращаемое значение:
                    a * b (float): площадь прямоугольника

            Пример вызова:
                    area(3, 5) -> 15
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по двум сторонам.

            Параметры:
                    a (float): первая сторона прямоугольника
                    b (float): вторая сторона прямоугольника

            Возвращаемое значение:
                    2 * (a + b) (float): периметр прямоугольника

            Пример вызова:
                    perimeter(3, 5) -> 16
    '''
    return 2 * (a + b)