def area(a):
    '''
    Возвращает площадь квадрата по заданной стороне.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    a * a (float): площадь квадрата

            Пример вызова:
                    area(4) -> 16
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по заданной стороне.

            Параметры:
                    a (float): сторона квадрата

            Возвращаемое значение:
                    4 * a (float): периметр квадрата

            Пример вызова:
                    perimeter(4) -> 16
    '''
    return 4 * a