def area(a, h):
    '''
    Возвращает площадь треугольника по основанию и высоте.

            Параметры:
                    a (int/float): основание треугольника
                    h (int/float): высота, проведенная к основанию

            Возвращаемое значение:
                    a * h / 2 (float): площадь треугольника

            Пример вызова:
                    area(6, 4) -> 12.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по трем его сторонам.

            Параметры:
                    a (int/float): первая сторона треугольника
                    b (int/float): вторая сторона треугольника
                    c (int/float): третья сторона треугольника

            Возвращаемое значение:
                    a + b + c (int/float): периметр треугольника

            Пример вызова:
                    perimeter(3, 4, 5) -> 12
    '''
    return a + b + c